subject_list = {
    "Математика": ["Дискретка", "Матан", "Линал", "Ангем", "Диффуры", "Теорвер и Матстат"],
    "Информатика": ["Информатика", "ОСы"],
    "Программирование": ["C", "Python", "Go", "Bash", "Java", "Архитектура ЭВМ",
                         "Алгоритмы и структуры данных", "Алгоритмы и структуры данных", "ООП", "Веб"],
    "Физика": ["Физика", "Физика с элементами компьютерного моделирования",
               "Основы термодинамики и тепломассообмена", "Физика твердого тела", "Общая электротехника",
               "Оптика", "Механика"],
    "Химия": ["Химия", "Физическая химия", "Ан. химия и ф-х методы анализа"],
    "Гум": ["Философия", "Правоведение"],
    "Английский": ["A1", "A2", "B1", "B2", "C1", "C2"],
    "Киг": [],
    "Креотех": []
}
